app/views/gossips/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 1]]
---
      <td><button type="button" class="btn btn-xl btn-ligth">
  Comment <span class="badge badge-dark"><%= gossip.comments.count%></span>