app/views/gossips/show.html.erb

  </thead>
<% @gossip.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 2]]