app/controllers/comments_controller.rb

	def create
		@comment = Comment.new(anonymous_commentor: params["anonymous_author"], body: params["body"])
		@gossip = Gossip.find(params[:gossip_id])
		@comment.gossip = @gossip
		@comment.save
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("anonymous_commentor", "body", "gossip_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["anonymous_commentor", "nom"], ["body", "pas nom"], ["gossip_id", 2], ["created_at", "2018-05-02 00:19:29.266770"], ["updated_at", "2018-05-02 00:19:29.266770"]]

	def edit
        @gossip = Gossip.find(params[:gossip_id])
        @comment = Comment.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @comment = Comment.find(params[:id])
        @gossip = Gossip.find(params[:gossip_id])
        @comment.update(anonymous_commentor: params["anonymous_author"], body: params["body"])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "anonymous_commentor" = ?, "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["anonymous_commentor", "anarana"], ["body", "gasyy"], ["updated_at", "2018-05-02 00:45:58.925476"], ["id", 1]]

    def destroy
        @gossip = Gossip.find(params[:gossip_id])
        @comment = Comment.find(params[:id])
        @comment.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]