app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anonymous_author", "Njara"], ["content", "bilgate"], ["created_at", "2018-05-01 08:18:16.857419"], ["updated_at", "2018-05-01 08:18:16.857419"]]
---
    def create
        @gossip = Gossip.new
        @gossip.anonymous_author = params['auteur']
        @gossip.content= params['content']
        @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 2]]
---
    def show
        @gossip = Gossip.find(params[:id])
        @comments = Comment.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = ?, "anonymous_author" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["content", "tsy alefa"], ["anonymous_author", "Alefa"], ["updated_at", "2018-05-01 19:40:21.722881"], ["id", 7]]
---
    def update
    @gossip = Gossip.find(params[:id])
    @gossip.content = params["content"]
    @gossip.anonymous_author = params["auteur"]
    @gossip.save